; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; El port esportiu de València :D
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain puerto)
	(:requirements :strips :equality :typing :fluents)
	(:types 
		location container stack rail arm num - object
	)
	(:predicates
		(next ?n1 - num ?n2 - num ?l - location)
		(at ?s - (either stack arm container rail) ?l - location)
		(empty ?s - stack)
		(actual ?s - stack ?n - num)

		(max_height ?l - location ?n - num)

		(free ?a - (either arm rail))
		(holding ?a - arm ?c - container)

		(transported ?c - container ?r - rail)
		(to ?r - rail ?l2 - location)

		(top ?c - container ?s - stack)
		(in ?c - container ?s - (either stack rail))
		(on ?c - container ?x - (either container stack))
		(clear ?c - container)

		(is_target ?c - container)
		(is_regular ?c - container)

		(available ?t - container)
	)
	;;	(:functions
	;;		(actual_height ?s - stack) ;ref: https://planning.wiki/ref/pddl21/domain
	;;		(max_height ?s - stack); ----^
	;;	)

	;;;;;;;;;;;
	;;ACTIONS;;
	;;;;;;;;;;;

	;;stack
	(:action stackOnEmpty
		:parameters (
			?c - container 
			?a - arm 
			?s - stack
			?l - location
			?current ?next ?max - num
		)
		:precondition (and 
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?c ?l)
			(at ?s ?l)

			;;scneario: no containers
			(holding ?a ?c)
			(empty ?s)

			;;height: max containers per location 
			(actual ?s ?current)
			(next ?current ?next ?l)
		)
		:effect (and 
			;;delete previous state
			(not (empty ?s))
			(not (holding ?a ?c))

			;;set new state
			(top ?c ?s)
			(in ?c ?s)
			(on ?c ?s)
			(clear ?c)
			(free ?a)
			(available ?c)

			;;counter
			(not (actual ?s ?current))
			(actual ?s ?next)

		)
	)
	(:action stackOnContainer_regular
		:parameters (
			?t - container
			?c - container
			?a - arm 
			?s - stack
			?l - location
			?current ?next ?max - num
		)
		:precondition (and 
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?t ?l)
			(at ?s ?l)

			;;scneario: >1 container
			(holding ?a ?t)
			(top ?c ?s)

			;;height: max containers per location 
			(actual ?s ?current)
			(next ?current ?next ?l)
			(is_regular ?c)
		)
		:effect (and 
			;;delete previous state
			(not (top ?c ?s))
			(not (holding ?a ?t))

			;;set new state
			(top ?t ?s)
			(in ?t ?s)
			(on ?t ?c)
			(clear ?t)
			(free ?a)

			(not(available ?c))

			;;counter
			(not (actual ?s ?current))
			(actual ?s ?next)

		)
	)
	(:action stackOnContainer_target
		:parameters (
			?t - container
			?c - container
			?a - arm 
			?s - stack
			?l - location
			?current ?next ?max - num
		)
		:precondition (and 
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?t ?l)
			(at ?s ?l)

			;;scneario: >1 container
			(holding ?a ?t)
			(top ?c ?s)

			;;height: max containers per location 
			(actual ?s ?current)
			(next ?current ?next ?l)
			(is_target ?t)
		)
		:effect (and 
			;;delete previous state
			(not (top ?c ?s))
			(not (holding ?a ?t))

			;;set new state
			(top ?t ?s)
			(in ?t ?s)
			(on ?t ?c)
			(clear ?t)
			(free ?a)

			(available ?t) ;;action

			;;counter
			(not (actual ?s ?current))
			(actual ?s ?next)

		)
	)
	;;unstack
	(:action unstack
		:parameters (
			?t ?c - container
			?a - arm 
			?s - stack
			?l - location
			?current ?prev - num
		)
		:precondition (and
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?c ?l)
			(at ?t ?l)
			(at ?s ?l)

			;;scenario: remove container from top of the other
			(top ?t ?s)
			(in ?t ?s)
			(on ?t ?c)
			(clear ?t)
			(free ?a)

			;;height: pointers to set the count 
			(actual ?s ?current)
			(next ?prev ?current ?l)
		)
		:effect (and 
			;;delete previous state
			(not (top ?t ?s))
			(not (in ?t ?s))
			(not (on ?t ?c))
			(not (clear ?t))
			(not (free ?a))
			(not (available ?t))

			;;set new state
			(top ?c ?s)
			(clear ?c)
			(available ?c)
			(holding ?a ?t)		

			;;counter
			(not (actual ?s ?current))
			(actual ?s ?prev)
		)
	)
	(:action unstackToFree
		:parameters (
			?t - container
			?a - arm 
			?s - stack
			?l - location
			?current ?prev - num
		)
		:precondition (and
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?t ?l)
			(at ?s ?l)

			;;scenario: remove last container from stack
			(top ?t ?s)
			(in ?t ?s)
			(on ?t ?s)
			(clear ?t)
			(free ?a)

			;;height: pointers to set the count 
			(actual ?s ?current)
			(next ?prev ?current ?l)
		)
		:effect (and 
			;;delete previous state
			(not (top ?t ?s))
			(not (in ?t ?s))
			(not (on ?t ?s))
			(not (clear ?t))
			(not (free ?a))
			(not (available ?t))

			;;set new state
			(empty ?s)
			(holding ?a ?t)

			;;counter
			(not (actual ?s ?current))
			(actual ?s ?prev)
		)
	)

	;;placeInRail
	(:action placeInRail
		:parameters (
			?l - location
			?a - arm
			?c - container
			?r - rail
		)
		:precondition (and
			;;location: everything in the same part of the port
			(at ?a ?l)
			(at ?c ?l)
			(at ?r ?l)

			;;scenario
			(holding ?a ?c)
			(free ?r)
		)
		:effect (and
			;;delete previous state
			(not (holding ?a ?c))
			(not (free ?r))

			;;set new state
			(in ?c ?r)
			(free ?a)
		)
	)

	;;pickFromRail
	(:action pickFromRail
		:parameters (
			?r - rail
			?l - location
			?c - container
			?a - arm
		)
		:precondition (and
			(in ?c ?r)
			(to ?r ?l)
			(transported ?c ?r)
			(at ?a ?l)
			(free ?a)
		)
		:effect (and
			;;delete previous state
			(not (in ?c ?r))
			(not (transported ?c ?r))
			(not (free ?a))
			
			;;set new state
			;;(at ?c ?l) ho fa el trasport
			(holding ?a ?c)
			(free ?r)
		)
	)

	;;transport
	(:action transport ;;polivalent xd
		:parameters (
			?r - rail
			?c - container
			?lsrc - location
			?ldst - location
		)

		:precondition (and 
			;;(at ?c ?lsrc)
			(at ?r ?lsrc)
			(to ?r ?ldst)
			(in ?c ?r)
		)
		:effect (and
			;;delete previous state
			(not (at ?c ?lsrc))
			
			;;set new state
			(at ?c ?ldst)
			(transported ?c ?r) ;;since, for the first problem, this is inmediate
		)

	)
	
)

; problem
(define (problem p1)
    (:domain puerto)
    (:objects
		;;loc 1
		l1 - location
		a1 - arm
		r1 - rail

		s11 - stack
		t7 - container
		c1 - container
		
		s12 - stack
		c10 - container
		c9 - container
            
		s13 - stack
		c11 - container

		;;loc 2
		l2 - location
		a2 - arm
		r2 - rail

		s21 - stack
		c8 - container
		t4 - container
		
		s22 - stack
		c2 - container
		t3 - container
		c5 - container
            
		s23 - stack
		c6 - container

		n0 - num
		n1 - num
		n2 - num
		n3 - num
		n4 - num
	)
	(:init
		(next n0 n1 l1)
		(next n1 n2 l1)

		(next n0 n1 l2)
		(next n1 n2 l2)
		(next n2 n3 l2)

		;;Location 1
		;;containers at location
		(at t7 l1)
		(at c1 l1)
		(at c10 l1)
		(at c9 l1)
		(at c11 l1)

		;;stacks at location
		(at s11 l1)
		(at s12 l1)
		(at s13 l1)

		;;arm at location
		(at a1 l1)

		;;rail at location
		(at r1 l1)

		;;count for rails
		(actual s11 n2)
		(actual s12 n2)
		(actual s13 n1)

		;;max height for location 1
		(max_height l1 n2)

		;;free rail1
		(free r1)

		;;free arm1
		(free a1)

		;;orientation rail1
		(to r1 l2)

		;;container states location 1
		(available t7)
		(clear t7)
		(top t7 s11)
		(in t7 s11)
		(on t7 c1)
		(in c1 s11)
		(on c1 s11)

		(clear c10)
		(top c10 s12)
		(in c10 s12)
		(on c10 c9)
		(in c9 s12)
		(on c9 s12)

		(clear c11)
		(top c11 s13)
		(in c11 s13)
		(on c11 s13)

		;;containers identity
		(is_target t7)
		(is_regular c1)
		(is_regular c10)
		(is_regular c9)	
		(is_regular c11)

;		;Location 2
		;;containers at location 2
		(at c8 l2)
		(at t4 l2)
		(at c2 l2)
		(at t3 l2)
		(at c5 l2)
		(at c6 l2)

		;;stacks at location
		(at s21 l2)
		(at s22 l2)
		(at s23 l2)

		;;arm at location
		(at a2 l2)

		;;rail at location
		(at r2 l2)

		;;count for rails
		(actual s21 n2)
		(actual s22 n3)
		(actual s23 n1)

		;;max height for location 1
		(max_height l2 n3)

		;;free rail1
		(free r2)

		;;free arm1
		(free a2)

		;;orientation rail1
		(to r2 l1)

		;;container states location 1
		(clear c8)
		(top c8 s21)
		(in c8 s21)
		(on c8 t4)
		(in t4 s21)
		(on t4 s21)

		(clear c2)
		(top c2 s22)
		(in c2 s22)
		(on c2 t3)
		(in t3 s22)
		(on t3 c5)
		(in c5 s22)
		(on c5 s22)

		(clear c6)
		(top c6 s23)
		(in c6 s23)
		(on c6 s23)

		;;containers identity
		(is_target t4)
		(is_target t3)
		(is_regular c8)
		(is_regular c2)
		(is_regular c5)	
		(is_regular c6)

	)
	(:goal (and
		(at t7 l1)
		(at t4 l1)
		(at t3 l1)
		(available t7)
		(available t4)
		(available t3)

		;;avoid letting containers in the rail
		(free r1)
		(free r2)

		;;avoid letting containers at hand
		(free a1)
		(free a2)
	))
	(:metric minimize (total-time))
)

; plan
1. (unstack c2 t3 a2 s22 l2 n3 n2)
   deleted: (top c2 s22) (in c2 s22) (on c2 t3) (clear c2) (free a2) (actual s22 n3)
   added: (top t3 s22) (clear t3) (available t3) (holding a2 c2) (actual s22 n2)
   goals met: 6 of 10
2. (stackoncontainer_regular c2 c6 a2 s23 l2 n1 n2 n4)
   deleted: (top c6 s23) (holding a2 c2) (actual s23 n1)
   added: (top c2 s23) (in c2 s23) (on c2 c6) (clear c2) (free a2) (actual s23 n2)
   goals met: 7 of 10
3. (unstack c8 t4 a2 s21 l2 n2 n1)
   deleted: (top c8 s21) (in c8 s21) (on c8 t4) (clear c8) (free a2) (actual s21 n2)
   added: (top t4 s21) (clear t4) (available t4) (holding a2 c8) (actual s21 n1)
   goals met: 7 of 10
4. (stackoncontainer_regular c8 c2 a2 s23 l2 n2 n3 n4)
   deleted: (top c2 s23) (holding a2 c8) (actual s23 n2)
   added: (top c8 s23) (in c8 s23) (on c8 c2) (clear c8) (free a2) (actual s23 n3)
   goals met: 8 of 10
5. (unstacktofree t4 a2 s21 l2 n1 n0)
   deleted: (top t4 s21) (in t4 s21) (on t4 s21) (clear t4) (free a2) (available t4) (actual s21 n1)
   added: (empty s21) (holding a2 t4) (actual s21 n0)
   goals met: 6 of 10
6. (placeinrail l2 a2 t4 r2)
   deleted: (holding a2 t4) (free r2)
   added: (in t4 r2) (free a2)
   goals met: 6 of 10
7. (transport r2 t4 l2 l1)
   deleted: (at t4 l2)
   added: (at t4 l1) (transported t4 r2)
   goals met: 7 of 10
8. (unstack t3 c5 a2 s22 l2 n2 n1)
   deleted: (top t3 s22) (in t3 s22) (on t3 c5) (clear t3) (free a2) (available t3) (actual s22 n2)
   added: (top c5 s22) (clear c5) (available c5) (holding a2 t3) (actual s22 n1)
   goals met: 5 of 10
9. (pickfromrail r2 l1 t4 a1)
   deleted: (in t4 r2) (transported t4 r2) (free a1)
   added: (holding a1 t4) (free r2)
   goals met: 5 of 10
10. (stackoncontainer_target t4 c11 a1 s13 l1 n1 n2 n4)
   deleted: (top c11 s13) (holding a1 t4) (actual s13 n1)
   added: (top t4 s13) (in t4 s13) (on t4 c11) (clear t4) (free a1) (available t4) (actual s13 n2)
   goals met: 7 of 10
11. (placeinrail l2 a2 t3 r2)
   deleted: (holding a2 t3) (free r2)
   added: (in t3 r2) (free a2)
   goals met: 7 of 10
12. (transport r2 t3 l2 l1)
   deleted: (at t3 l2)
   added: (at t3 l1) (transported t3 r2)
   goals met: 8 of 10
13. (unstack c10 c9 a1 s12 l1 n2 n1)
   deleted: (top c10 s12) (in c10 s12) (on c10 c9) (clear c10) (free a1) (actual s12 n2)
   added: (top c9 s12) (clear c9) (available c9) (holding a1 c10) (actual s12 n1)
   goals met: 7 of 10
14. (placeinrail l1 a1 c10 r1)
   deleted: (holding a1 c10) (free r1)
   added: (in c10 r1) (free a1)
   goals met: 7 of 10
15. (transport r1 c10 l1 l2)
   deleted: (at c10 l1)
   added: (at c10 l2) (transported c10 r1)
   goals met: 7 of 10
16. (pickfromrail r2 l1 t3 a1)
   deleted: (in t3 r2) (transported t3 r2) (free a1)
   added: (holding a1 t3) (free r2)
   goals met: 7 of 10
17. (stackoncontainer_target t3 c9 a1 s12 l1 n1 n2 n4)
   deleted: (top c9 s12) (holding a1 t3) (actual s12 n1)
   added: (top t3 s12) (in t3 s12) (on t3 c9) (clear t3) (free a1) (available t3) (actual s12 n2)
   goals met: 9 of 10
18. (pickfromrail r1 l2 c10 a2)
   deleted: (in c10 r1) (transported c10 r1) (free a2)
   added: (holding a2 c10) (free r1)
   goals met: 9 of 10
19. (stackoncontainer_regular c10 c5 a2 s22 l2 n1 n2 n4)
   deleted: (top c5 s22) (holding a2 c10) (available c5) (actual s22 n1)
   added: (top c10 s22) (in c10 s22) (on c10 c5) (clear c10) (free a2) (actual s22 n2)
   goals met: 10 of 10
